app/Http/Controllers/DeveloperController.php

    public function index()
    {
        list($languages, $programmingLanguages) = $this->loadSelects();

        $developers = Developer::filter()->paginate(5);
---
select * from `developers` limit 5 offset 0
select count(*) as aggregate from `developers`

    public function store(Request $request)
    {
        $developer = Developer::create($request->only('email'));
        $developer->programmingLanguages()->attach($request->programming_language_ids);
        $developer->languages()->attach($request->language_ids);
---
insert into `developer_programming_language` (`developer_id`, `programming_language_id`) values ('1', '1')
insert into `developer_language` (`developer_id`, `language_id`) values ('1', '1')