app/Http/Controllers/LanguageController.php

select count(*) as aggregate from `languages`
---
    public function index()
    {
        $languages = Language::withCount('developers')->paginate(10);

update `languages` set `code` = 'Nostrusdsd', `updated_at` = '2018-10-03 18:13:19' where `id` = '1'
---
    public function update(Request $request, Language $language)
    {
        $language->update(
            $request->only('code')
        );