app/Http/Controllers/ProgrammingLanguageController.php

    public function index()
    {
        $programmingLanguages = ProgrammingLanguage::withCount('developers')->paginate(10);
---
select count(*) as aggregate from `programming_languages`